export const mingtu = ["存护", "记忆", "虚无", "丰饶", "巡猎", "毁灭", "欢愉"];
const data = [
  {
    name: "沙王",

    children: [
      [
        { name: "沙王-其一", data: "记忆，毁灭" },
        { name: "沙王-其二", data: "记忆，毁灭" },
        { name: "沙王-其三", data: "欢愉，虚无" },
      ],
      [
        { name: "沙王-其四", data: "毁灭，存护，欢愉，虚无" },
        { name: "沙王-其五", data: "丰饶，存护" },
        { name: "沙王-其六", data: "丰饶，存护，虚无" },
      ],
      [
        { name: "沙王-其七", data: "存护，毁灭" },
        { name: "沙王-其八", data: "存护，毁灭" },
        { name: "沙王-其九", data: "存护，欢愉" },
      ],
    ],
  },
  {
    // 蠹星系-屠杀纪
    name: "蠹星系",
    children: [
      [
        { name: "蠹星系-其一", data: "虚无，存护" },
        { name: "蠹星系-其二", data: "毁灭，虚无" },
        { name: "蠹星系-其三", data: "毁灭，虚无" },
      ],
      [
        { name: "蠹星系-其四", data: "记忆，存护" },
        { name: "蠹星系-其五", data: "存护，欢愉" },
        { name: "蠹星系-其六", data: "巡猎，虚无" },
      ],
    ],
  },
  {
    name: "赏金猎人",

    children: [
      [
        { name: "赏金猎人-其一", data: "虚无，丰饶" },
        { name: "赏金猎人-其二", data: "记忆" },
        { name: "赏金猎人-其三", data: "丰饶，虚无" },
      ],
      [
        { name: "赏金猎人-其四", data: "丰饶，虚无" },
        { name: "赏金猎人-其五", data: "毁灭，欢愉" },
        { name: "赏金猎人-其六", data: "虚无" },
      ],
    ],
  },
  {
    name: "凶与虫",

    children: [
      [
        { name: "凶与虫-其一", data: "存护，欢愉" },
        { name: "凶与虫-其二", data: "存护，毁灭" },
        { name: "凶与虫-其三", data: "巡猎，记忆" },
      ],
      [
        { name: "凶与虫-其四", data: "欢愉，巡猎" },
        { name: "凶与虫-其五", data: "记忆，存护" },
        { name: "凶与虫-其六", data: "虚无，存护，欢愉" },
      ],
    ],
  },
  {
    name: "天才俱乐部",

    children: [
      [
        { name: "天才俱乐部-其一", data: "丰饶，欢愉" },
        { name: "天才俱乐部-其二", data: "丰饶，虚无" },
        { name: "天才俱乐部-其三", data: "虚无，存护" },
      ],
    ],
  },
  {
    name: "贡多拉",

    children: [
      [
        { name: "贡多拉-其一", data: "记忆，欢愉" },
        { name: "贡多拉-其二", data: "欢愉，存护" },
        { name: "贡多拉-其三", data: "存护，欢愉" },
      ],
      [
        { name: "贡多拉-其四", data: "欢愉，丰饶" },
        { name: "贡多拉-其五", data: "记忆，虚无" },
        { name: "贡多拉-其六", data: "记忆，欢愉" },
      ],
    ],
  },
  {
    name: "天外合唱班",
    children: [
      [
        { name: "天外合唱班-其一", data: "虚无，丰饶" },
        { name: "天外合唱班-其二", data: "虚无，存护" },
        { name: "天外合唱班-其三", data: "存护，巡猎" },
      ],
    ],
  },
  {
    // 筑城者-修筑纪
    name: "筑城者",
    children: [
      [
        { name: "筑城者-其一", data: "欢愉，毁灭" },
        { name: "筑城者-其二", data: "巡猎，丰饶" },
        { name: "筑城者-其三", data: "记忆，虚无" },
      ],
    ],
  },
];

export default data;
